---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ColumnInsideWallFailures.StopCutShadowJoin
source: html/1d0a8831-c4d4-645c-4f35-a64f68fc5622.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ColumnInsideWallFailures.StopCutShadowJoin Property

Two joined walls are no longer in a position to allow automatic insert copying. They are either non-parallel or non-overlapping.

## Syntax (C#)
```csharp
public static FailureDefinitionId StopCutShadowJoin { get; }
```